tutorials/heatTransfer/buoyantPisoFoam/hotRoom/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

compileApplication ../../setHotRoom
runApplication blockMesh
runApplication setHotRoom
runApplication $application
